# MutipleStairsPathInOneRunFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..MutipleStairsPathInOneRunFailure Property
BuiltInFailures..::..SketchFailures Class See Also
---
Each stairs run can only have one stairs path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MutipleStairsPathInOneRunFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MutipleStairsPathInOneRunFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MutipleStairsPathInOneRunFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace